In [1]:
import pandas as pd
pd.__version__

'2.3.0'

## Pandas Categorical

### create a categorical series

In [2]:
data = ['a', 'b', 'c', 'd', '1']
ser = pd.Series(data, dtype="category")
ser

0    a
1    b
2    c
3    d
4    1
dtype: category
Categories (5, object): ['1', 'a', 'b', 'c', 'd']

### Create Categorical DataFrame

In [3]:
df = pd.DataFrame({"Cat1": list("pqrs"), "Cat2": list("pqrp"), "Cat3": list("qrrr")}, dtype="category")
print("DataFrame = \n", df)
 
# Display the datatypes
print("\nDataType of each column = \n", df.dtypes)

DataFrame =
   Cat1 Cat2 Cat3
0    p    p    q
1    q    q    r
2    r    r    r
3    s    p    r

DataType of each column =
 Cat1    category
Cat2    category
Cat3    category
dtype: object

In [4]:
for i,j in df.dtypes.items():
    print(i, j)

Cat1 category
Cat2 category
Cat3 category

## Pandas â€“ Indexing & Selecting

In [119]:
students = pd.read_excel("../data/sample_students.xlsx")
students.head()

   StudentID     Name  Age Grade  MathScore  EnglishScore
0          1    Alice   14   9th         88            90
1          2      Bob   15  10th         92            85
2          3  Charlie   14   9th         85            88
3          4    David   16  11th         90            92
4          5      Eva   15  10th         78            80

In [120]:
print(f'Grades:\n{students['Grade']}\n')
print(f'first row:\n{students.loc[0]}')
print(f'first row and first column {students.iloc[0,0]}')

Grades:
0      9th
1     10th
2      9th
3     11th
4     10th
5      9th
6      8th
7     11th
8     10th
9      9th
10     8th
11    11th
12    10th
13     9th
14    10th
15     9th
16     8th
17    11th
18    10th
19     9th
Name: Grade, dtype: object

first row:
StudentID           1
Name            Alice
Age                14
Grade             9th
MathScore          88
EnglishScore       90
Name: 0, dtype: object
first row and first column 1

In [121]:
students.loc[1:4, 'Name':], students.iloc[1:4, 1:]

(      Name  Age Grade  MathScore  EnglishScore
 1      Bob   15  10th         92            85
 2  Charlie   14   9th         85            88
 3    David   16  11th         90            92
 4      Eva   15  10th         78            80,
       Name  Age Grade  MathScore  EnglishScore
 1      Bob   15  10th         92            85
 2  Charlie   14   9th         85            88
 3    David   16  11th         90            92)

## filter

In [122]:
students[students['MathScore'] > 90]

    StudentID    Name  Age Grade  MathScore  EnglishScore
1           2     Bob   15  10th         92            85
7           8  Hannah   16  11th         95            93
11         12   Laura   16  11th         91            89
17         18  Rachel   16  11th         93            91

## Pandas â€“ Data Manipulation

### Add a new column to Pandas DataFrame

In [123]:
PhysicsScore =[85, 92, 78, 95, 88, 76, 90, 82, 98, 89, 75, 91, 84, 96, 87, 93, 79, 94, 86, 81]
students.insert(5, "PhysicsScore", PhysicsScore)
students.head()

   StudentID     Name  Age Grade  MathScore  PhysicsScore  EnglishScore
0          1    Alice   14   9th         88            85            90
1          2      Bob   15  10th         92            92            85
2          3  Charlie   14   9th         85            78            88
3          4    David   16  11th         90            95            92
4          5      Eva   15  10th         78            88            80

In [124]:
students_new = students.assign(Biologyscores =  [88, 76, 91, 85, 98, 82, 95, 89, 78, 92, 86, 90, 74, 96, 87, 93, 80, 94, 84, 97])
students.head(), students_new.head()

(   StudentID     Name  Age Grade  MathScore  PhysicsScore  EnglishScore
 0          1    Alice   14   9th         88            85            90
 1          2      Bob   15  10th         92            92            85
 2          3  Charlie   14   9th         85            78            88
 3          4    David   16  11th         90            95            92
 4          5      Eva   15  10th         78            88            80,
    StudentID     Name  Age Grade  MathScore  PhysicsScore  EnglishScore  \
 0          1    Alice   14   9th         88            85            90
 1          2      Bob   15  10th         92            92            85
 2          3  Charlie   14   9th         85            78            88
 3          4    David   16  11th         90            95            92
 4          5      Eva   15  10th         78            88            80

    Biologyscores
 0             88
 1             76
 2             91
 3             85
 4             98  )

In [125]:
students_new['sample'] = [88, 76, 91, 85, 98, 82, 95, 89, 78, 92, 86, 90, 74, 96, 87, 93, 80, 94, 84, 97]

In [126]:
students_new.head()

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,Biologyscores,sample
0,1,Alice,14,9th,88,85,90,88,88
1,2,Bob,15,10th,92,92,85,76,76
2,3,Charlie,14,9th,85,78,88,91,91
3,4,David,16,11th,90,95,92,85,85
4,5,Eva,15,10th,78,88,80,98,98

### Delete rows/ columns in a Pandas DataFrame

In [127]:
students_new.drop(columns=['EnglishScore']).head()

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,Biologyscores,sample
0,1,Alice,14,9th,88,85,88,88
1,2,Bob,15,10th,92,92,76,76
2,3,Charlie,14,9th,85,78,91,91
3,4,David,16,11th,90,95,85,85
4,5,Eva,15,10th,78,88,98,98

In [128]:
students_new.head()

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,Biologyscores,sample
0,1,Alice,14,9th,88,85,90,88,88
1,2,Bob,15,10th,92,92,85,76,76
2,3,Charlie,14,9th,85,78,88,91,91
3,4,David,16,11th,90,95,92,85,85
4,5,Eva,15,10th,78,88,80,98,98

In [129]:
students_new.drop(columns=['sample'], inplace=True)
students_new.head()

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,Biologyscores
0,1,Alice,14,9th,88,85,90,88
1,2,Bob,15,10th,92,92,85,76
2,3,Charlie,14,9th,85,78,88,91
3,4,David,16,11th,90,95,92,85
4,5,Eva,15,10th,78,88,80,98

In [130]:
students_new.drop(index=[1]).head()

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,Biologyscores
0,1,Alice,14,9th,88,85,90,88
2,3,Charlie,14,9th,85,78,88,91
3,4,David,16,11th,90,95,92,85
4,5,Eva,15,10th,78,88,80,98
5,6,Frank,14,9th,84,76,87,82

### Iterate over rows and columns in a Pandas DataFrame

In [55]:
for row, value in students.head(3).iterrows():
    print(row, value)

0 StudentID           1
Name            Alice
Age                14
Grade             9th
MathScore          88
PhysicsScore       85
EnglishScore       90
Name: 0, dtype: object
1 StudentID          2
Name             Bob
Age               15
Grade           10th
MathScore         92
PhysicsScore      92
EnglishScore      85
Name: 1, dtype: object
2 StudentID             3
Name            Charlie
Age                  14
Grade               9th
MathScore            85
PhysicsScore         78
EnglishScore         88
Name: 2, dtype: object

In [58]:
for row in students.head(3).itertuples():
    print(row)
    print(row.Age)

Pandas(Index=0, StudentID=1, Name='Alice', Age=14, Grade='9th', MathScore=88, PhysicsScore=85, EnglishScore=90)
14
Pandas(Index=1, StudentID=2, Name='Bob', Age=15, Grade='10th', MathScore=92, PhysicsScore=92, EnglishScore=85)
15
Pandas(Index=2, StudentID=3, Name='Charlie', Age=14, Grade='9th', MathScore=85, PhysicsScore=78, EnglishScore=88)
14

In [64]:
for row, value in students.head(2).items():
    print(row, value)

StudentID 0    1
1    2
Name: StudentID, dtype: int64
Name 0    Alice
1      Bob
Name: Name, dtype: object
Age 0    14
1    15
Name: Age, dtype: int64
Grade 0     9th
1    10th
Name: Grade, dtype: object
MathScore 0    88
1    92
Name: MathScore, dtype: int64
PhysicsScore 0    85
1    92
Name: PhysicsScore, dtype: int64
EnglishScore 0    90
1    85
Name: EnglishScore, dtype: int64

In [63]:
students.head(1).items

<bound method DataFrame.items of    StudentID   Name  Age Grade  MathScore  PhysicsScore  EnglishScore
0          1  Alice   14   9th         88            85            90>

### Sorting in Pandas

In [131]:
students['AvgScore'] = (students['MathScore'] + students['PhysicsScore'] +students['EnglishScore'])/3
students['rank'] = students['AvgScore'].rank(method='min', ascending=False)
students.sort_values(by=['rank'], ascending=False)

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,AvgScore,rank
16,17,Quinn,13,8th,74,79,76,76.333333,20.0
10,11,Kevin,13,8th,77,75,78,76.666667,19.0
6,7,Grace,13,8th,76,90,75,80.333333,18.0
19,20,Tina,14,9th,80,81,82,81.000000,17.0
4,5,Eva,15,10th,78,88,80,82.000000,16.0
14,15,Oscar,15,10th,79,87,81,82.333333,14.0
5,6,Frank,14,9th,84,76,87,82.333333,14.0
2,3,Charlie,14,9th,85,78,88,83.666667,13.0
12,13,Mike,15,10th,87,84,85,85.333333,11.0
9,10,Jane,14,9th,83,89,84,85.333333,11.0
18,19,Steve,15,10th,86,86,87,86.333333,10.0
13,14,Nina,14,9th,82,96,83,87.000000,9.0
0,1,Alice,14,9th,88,85,90,87.666667,8.0
15,16,Paula,14,9th,85,93,86,88.000000,7.0
1,2,Bob,15,10th,92,92,85,89.666667,6.0
7,8,Hannah,16,11th,95,82,93,90.000000,5.0
11,12,Laura,16,11th,91,91,89,90.333333,4.0
8,9,Ian,15,10th,89,98,86,91.000000,3.0
3,4,David,16,11th,90,95,92,92.333333,2.0
17,18,Rachel,16,11th,93,94,91,92.666667,1.0

## Pandas â€“ Data Cleaning

### Find and Remove Duplicates from rows in Pandas

In [142]:
new_rows = {'StudentID': [1, 2, 3],
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [14, 15, 14],
        'Grade': ['9th', '10th', '9th'],
        'MathScore': [88, 92, 85],
        'PhysicsScore': [85, 92, 78],
        'EnglishScore': [90, 85, 88],
        'AvgScore': [(85+88+90)/3, (92+92+85)/3, (85+78+88)/3],
        'rank': [8.0, 6.0, 13.0]}
df = pd.DataFrame(new_rows)
students_dup = pd.concat([students, df], axis=0, ignore_index=True)
students_dup

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,AvgScore,rank
0,1,Alice,14,9th,88,85,90,87.666667,8.0
1,2,Bob,15,10th,92,92,85,89.666667,6.0
2,3,Charlie,14,9th,85,78,88,83.666667,13.0
3,4,David,16,11th,90,95,92,92.333333,2.0
4,5,Eva,15,10th,78,88,80,82.000000,16.0
5,6,Frank,14,9th,84,76,87,82.333333,14.0
6,7,Grace,13,8th,76,90,75,80.333333,18.0
7,8,Hannah,16,11th,95,82,93,90.000000,5.0
8,9,Ian,15,10th,89,98,86,91.000000,3.0
9,10,Jane,14,9th,83,89,84,85.333333,11.0
10,11,Kevin,13,8th,77,75,78,76.666667,19.0
11,12,Laura,16,11th,91,91,89,90.333333,4.0
12,13,Mike,15,10th,87,84,85,85.333333,11.0
13,14,Nina,14,9th,82,96,83,87.000000,9.0
14,15,Oscar,15,10th,79,87,81,82.333333,14.0
15,16,Paula,14,9th,85,93,86,88.000000,7.0
16,17,Quinn,13,8th,74,79,76,76.333333,20.0
17,18,Rachel,16,11th,93,94,91,92.666667,1.0
18,19,Steve,15,10th,86,86,87,86.333333,10.0
19,20,Tina,14,9th,80,81,82,81.000000,17.0
20,1,Alice,14,9th,88,85,90,87.666667,8.0
21,2,Bob,15,10th,92,92,85,89.666667,6.0
22,3,Charlie,14,9th,85,78,88,83.666667,13.0

In [143]:
students_dup.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20     True
21     True
22     True
dtype: bool

In [144]:
students_dup.drop_duplicates()

,StudentID,Name,Age,Grade,MathScore,PhysicsScore,EnglishScore,AvgScore,rank
0,1,Alice,14,9th,88,85,90,87.666667,8.0
1,2,Bob,15,10th,92,92,85,89.666667,6.0
2,3,Charlie,14,9th,85,78,88,83.666667,13.0
3,4,David,16,11th,90,95,92,92.333333,2.0
4,5,Eva,15,10th,78,88,80,82.000000,16.0
5,6,Frank,14,9th,84,76,87,82.333333,14.0
6,7,Grace,13,8th,76,90,75,80.333333,18.0
7,8,Hannah,16,11th,95,82,93,90.000000,5.0
8,9,Ian,15,10th,89,98,86,91.000000,3.0
9,10,Jane,14,9th,83,89,84,85.333333,11.0
10,11,Kevin,13,8th,77,75,78,76.666667,19.0
11,12,Laura,16,11th,91,91,89,90.333333,4.0
12,13,Mike,15,10th,87,84,85,85.333333,11.0
13,14,Nina,14,9th,82,96,83,87.000000,9.0
14,15,Oscar,15,10th,79,87,81,82.333333,14.0
15,16,Paula,14,9th,85,93,86,88.000000,7.0
16,17,Quinn,13,8th,74,79,76,76.333333,20.0
17,18,Rachel,16,11th,93,94,91,92.666667,1.0
18,19,Steve,15,10th,86,86,87,86.333333,10.0
19,20,Tina,14,9th,80,81,82,81.000000,17.0